roleId2Name = {"7469669948": "黎苏苏", "6547241437": "澹台烬",
               "1151347223": "东方青苍", "7771602278": "小兰花",
               "7866933100":"盛阳", "7866788825":"简冰"}
role2keywords = {
    "澹台烬":["长月烬明", "澹台烬", "黎苏苏", "叶夕雾","沧九旻","冥夜","桑酒","魔神","叶冰裳","萧凛","叶清宇","翩然","天欢","兆悠","公冶寂无","谛冕","邪骨","衢玄子","廿白羽","澹台明朗","娰婴", "惊灭", "九天勾玉", "过去镜", "洗髓印", "屠神弩", "倾世之玉", "重羽", "重羽箜篌", "灭魂钉", "同悲道","情丝","魔胎","叶家","景国","莹心","初凰","洗髓印","妖魔","逍遥","荒渊","仙髓","春桃","仙门","神髓","成魔","过去镜","衡阳宗","泽宇","姜饶","叶父","稷泽","墨河","盛王","屠神弩","炼化","盛国","荆兰安","结界","质子","夏国","桑佑","魔域","护心麟","帝冕","魔界","真神","反噬","历劫","真身","幽冥","妖力","妖丹","合修","魔气","魔器","灭魂","夷月族","神器","神女","战神","冰晶", "见生符", "上清神域", "元神","腾蛇族","灵力","柔妃","蛟龙","般若浮生","罪业","景王","叶府","蚌族","庞宜之","梓宓","叶啸"],
    "黎苏苏":["长月烬明", "澹台烬", "黎苏苏", "叶夕雾","沧九旻","冥夜","桑酒","魔神","叶冰裳","萧凛","叶清宇","翩然","天欢","兆悠","公冶寂无","谛冕","邪骨","衢玄子","廿白羽","澹台明朗","娰婴", "惊灭", "九天勾玉", "过去镜", "洗髓印", "屠神弩", "倾世之玉", "重羽", "重羽箜篌", "灭魂钉", "同悲道","情丝","魔胎","叶家","景国","莹心","初凰","洗髓印","妖魔","逍遥","荒渊","仙髓","春桃","仙门","神髓","成魔","过去镜","衡阳宗","泽宇","姜饶","叶父","稷泽","墨河","盛王","屠神弩","炼化","盛国","荆兰安","结界","质子","夏国","桑佑","魔域","护心麟","帝冕","魔界","真神","反噬","历劫","真身","幽冥","妖力","妖丹","合修","魔气","魔器","灭魂","夷月族","神器","神女","战神","冰晶", "见生符", "上清神域", "元神","腾蛇族","灵力","柔妃","蛟龙","般若浮生","罪业","景王","叶府","蚌族","庞宜之","梓宓","叶啸"],
    "盛阳":["罗美娟","薛易明","梁珊珊","盛向前","陈总","婚外情","宿醉","剧组","拍片","导师","舅舅","李慕嘉","广告界","好搭档","剪片","广告公司","方沐","奖杯","住院","公益广告","打人","庆功宴","广告行业","外遇","朋友圈","同学聚会","冰球","警察厅","简霜","策划案","俊杰","老李","潘柔","向小乔","王友德"],
    "简冰":["罗美娟","薛易明","梁珊珊","盛向前","陈总","婚外情","宿醉","剧组","拍片","导师","舅舅","李慕嘉","广告界","好搭档","剪片","广告公司","方沐","奖杯","住院","公益广告","打人","庆功宴","广告行业","外遇","朋友圈","同学聚会","冰球","警察厅","简霜","策划案","俊杰","老李","潘柔","向小乔","王友德"]
}
role2kb = {
    "澹台烬":"cyjm_juben_intro","黎苏苏":"cyjm_juben_intro",
    "东方青苍":"clj_juben_intro","小兰花":"clj_juben_intro",
    "盛阳":"jybw_content_intro","简冰":"jybw_content_intro",
    "林双":"hscs_juben_intro","顾许":"hscs_juben_intro",
    "江喜":"hscs_juben_intro","卫明":"hscs_juben_intro",
    "孙悟空":"xyj_juben_intro","唐僧":"xyj_juben_intro",
    "猪八戒":"xyj_juben_intro","沙和尚":"xyj_juben_intro",
    "关羽":"sgyy_content_intro","刘备":"sgyy_content_intro",
    "张飞":"sgyy_content_intro","诸葛亮":"sgyy_content_intro",
    "贾宝玉":"hlm_juben_intro","林黛玉":"hlm_juben_intro",
    "薛宝钗":"hlm_juben_intro","王熙凤":"hlm_juben_intro",
    "林冲":"shz_juben_intro","武松":"shz_juben_intro",
    "鲁智深":"shz_juben_intro","李逵":"shz_juben_intro",
    "孙悟空tc":"xyj_tc","唐僧tc":"xyj_tc",
    "猪八戒tc":"xyj_tc","沙和尚tc":"xyj_tc"
}
